<template>
  <section id="search">
    <v-container fluid>
      <v-row align="center" justify="center">
        <v-col cols="10">
          <v-row align="center" justify="center">
            <v-col cols="12" md="7">
              <h1 class="font-weight-light display-2 text-center ma-5">
                美容師検索
              </h1>
              <h2 class="font-weight-light display-1 ma-3">場所で検索</h2>
              <form>
                <div>
                  <v-text-field
                    class="ma-3"
                    label="検索キーワードを入力"
                    :rules="rules"
                    hide-details="auto"
                  >
                    <template #append-outer>
                      <v-btn color="#FAE290" elevation="5"> 検索 </v-btn>
                    </template>
                  </v-text-field>
                </div>
              </form>
              <h2 class="font-weight-light display-1 ma-3">
                フリーワードで検索
              </h2>
              <form>
                <div>
                  <v-text-field
                    class="ma-3"
                    label="検索キーワードを入力"
                    :rules="rules"
                    hide-details="auto"
                  >
                    <template #append-outer>
                      <v-btn color="#FAE290" elevation="5"> 検索 </v-btn>
                    </template>
                  </v-text-field>
                </div>
              </form>
              <form>
                <h2 class="font-weight-light display-1 ma-3">
                  詳細な条件で検索
                  <v-btn icon color="#FAE290">
                    <svg
                      width="31"
                      height="30"
                      viewBox="0 0 31 30"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        fill-rule="evenodd"
                        clip-rule="evenodd"
                        d="M1.9375 15C1.9375 18.481 3.3664 21.8194 5.90986 24.2808C8.45333 26.7422 11.903 28.125 15.5 28.125C19.097 28.125 22.5467 26.7422 25.0901 24.2808C27.6336 21.8194 29.0625 18.481 29.0625 15C29.0625 11.519 27.6336 8.18064 25.0901 5.71922C22.5467 3.25781 19.097 1.875 15.5 1.875C11.903 1.875 8.45333 3.25781 5.90986 5.71922C3.3664 8.18064 1.9375 11.519 1.9375 15ZM31 15C31 18.9782 29.367 22.7936 26.4602 25.6066C23.5533 28.4196 19.6109 30 15.5 30C11.3891 30 7.44666 28.4196 4.53984 25.6066C1.63303 22.7936 0 18.9782 0 15C0 11.0218 1.63303 7.20644 4.53984 4.3934C7.44666 1.58035 11.3891 0 15.5 0C19.6109 0 23.5533 1.58035 26.4602 4.3934C29.367 7.20644 31 11.0218 31 15ZM8.71875 14.0625C8.46182 14.0625 8.21542 14.1613 8.03374 14.3371C7.85206 14.5129 7.75 14.7514 7.75 15C7.75 15.2486 7.85206 15.4871 8.03374 15.6629C8.21542 15.8387 8.46182 15.9375 8.71875 15.9375H19.9427L15.7829 19.9613C15.6928 20.0484 15.6214 20.1519 15.5726 20.2658C15.5239 20.3797 15.4988 20.5017 15.4988 20.625C15.4988 20.7483 15.5239 20.8703 15.5726 20.9842C15.6214 21.0981 15.6928 21.2016 15.7829 21.2887C15.8729 21.3759 15.9799 21.4451 16.0976 21.4922C16.2152 21.5394 16.3414 21.5637 16.4688 21.5637C16.5961 21.5637 16.7223 21.5394 16.8399 21.4922C16.9576 21.4451 17.0646 21.3759 17.1546 21.2887L22.9671 15.6637C23.0573 15.5767 23.1289 15.4732 23.1778 15.3593C23.2266 15.2454 23.2517 15.1233 23.2517 15C23.2517 14.8767 23.2266 14.7546 23.1778 14.6407C23.1289 14.5268 23.0573 14.4233 22.9671 14.3363L17.1546 8.71125C17.0646 8.62408 16.9576 8.55494 16.8399 8.50777C16.7223 8.4606 16.5961 8.43632 16.4688 8.43632C16.3414 8.43632 16.2152 8.4606 16.0976 8.50777C15.9799 8.55494 15.8729 8.62408 15.7829 8.71125C15.6928 8.79842 15.6214 8.90189 15.5726 9.01578C15.5239 9.12967 15.4988 9.25173 15.4988 9.375C15.4988 9.49827 15.5239 9.62033 15.5726 9.73422C15.6214 9.84811 15.6928 9.95158 15.7829 10.0387L19.9427 14.0625H8.71875Z"
                        fill="black"
                      />
                    </svg>
                  </v-btn>
                </h2>
              </form>
            </v-col>
          </v-row>
        </v-col>
      </v-row>
    </v-container>
  </section>
</template>

<script>
export default {
  data: () => ({
    rules: [
      (value) => !!value || 'Required.',
      (value) => (value && value.length >= 3) || 'Min 3 characters',
    ],
  }),
}
</script>

<style scoped>
#search {
  background-color: #f4f7f5;
}
</style>
